import java.util.Scanner;

public class homeIV {
    public static void main(String[] args) {
        try (Scanner scan = new Scanner(System.in)) {
            String ชื่อสินค้า, ชื่อผู้ซื้อ;
            float ราคาสินค้า, อัตราดอกเบี้ยต่อเดือน, ดอกเบี้ยทั้งหมด, ดอกเบี้ยต่อเดือน, จำนวนงวดที่ต้องการผ่อนชำระ,
                    ราคาสินค้ารวมดอกเบี้ยทั้งหมด, จำนวนเงินที่ต้องผ่อนชำระต่อเดือน;

            System.out.print("ชื่อสินค้า ");
            ชื่อสินค้า = scan.nextLine();
            System.out.print("ชื่อผู้ซื้อ ");
            ชื่อผู้ซื้อ = scan.nextLine();
            System.out.print("ราคาสินค้า ");
            ราคาสินค้า = scan.nextFloat();
            System.out.print("จำนวนงวดที่ต้องการผ่อนชำระ ");
            จำนวนงวดที่ต้องการผ่อนชำระ = scan.nextFloat();

            if (ราคาสินค้า > 1 && ราคาสินค้า <= 2000) {
                อัตราดอกเบี้ยต่อเดือน = 0.01f;
            } else if (ราคาสินค้า >= 2001 && ราคาสินค้า <= 5000) {
                อัตราดอกเบี้ยต่อเดือน = 0.015f;
            } else if (ราคาสินค้า >= 5001 && ราคาสินค้า <= 10000) {
                อัตราดอกเบี้ยต่อเดือน = 0.02f;
            } else if (ราคาสินค้า >= 10001 && ราคาสินค้า <= 20000) {
                อัตราดอกเบี้ยต่อเดือน = 0.025f;
            } else
                อัตราดอกเบี้ยต่อเดือน = 0.03f;

            ดอกเบี้ยต่อเดือน = ราคาสินค้า * อัตราดอกเบี้ยต่อเดือน;
            ดอกเบี้ยทั้งหมด = ดอกเบี้ยต่อเดือน * จำนวนงวดที่ต้องการผ่อนชำระ;
            ราคาสินค้ารวมดอกเบี้ยทั้งหมด = ราคาสินค้า + ดอกเบี้ยทั้งหมด;
            จำนวนเงินที่ต้องผ่อนชำระต่อเดือน = ราคาสินค้ารวมดอกเบี้ยทั้งหมด / จำนวนงวดที่ต้องการผ่อนชำระ;

            System.out.println(ชื่อผู้ซื้อ);
            System.out.println(ชื่อสินค้า);
            System.out.println(ดอกเบี้ยต่อเดือน);
            System.out.println(ดอกเบี้ยทั้งหมด);
            System.out.println("ราคาสินค้ารวมดอกเบี้ยทั้งหมด -->" + ราคาสินค้ารวมดอกเบี้ยทั้งหมด);
            System.out.println("จำนวนเงินที่ต้องผ่อนชำระต่อเดือน -->" + จำนวนเงินที่ต้องผ่อนชำระต่อเดือน);
        }
    }
}
